In [1]:
import numpy as np

In [2]:
import pandas as pd

# Object creation

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range("20130101", periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [8]:
df

                   A         B         C         D
2013-01-01 -0.480964 -0.465493 -0.313580 -0.015631
2013-01-02  0.397200  1.254354 -0.004452 -0.056798
2013-01-03  0.211643 -0.587215  0.434053 -0.632293
2013-01-04 -0.424273 -0.238610 -0.750169 -1.201214
2013-01-05 -0.378145 -1.154399 -0.395025  0.945758
2013-01-06 -0.154958  1.289145  1.917362  0.136792

In [9]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing data

In [12]:
df.head()

                   A         B         C         D
2013-01-01 -0.480964 -0.465493 -0.313580 -0.015631
2013-01-02  0.397200  1.254354 -0.004452 -0.056798
2013-01-03  0.211643 -0.587215  0.434053 -0.632293
2013-01-04 -0.424273 -0.238610 -0.750169 -1.201214
2013-01-05 -0.378145 -1.154399 -0.395025  0.945758

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.424273 -0.238610 -0.750169 -1.201214
2013-01-05 -0.378145 -1.154399 -0.395025  0.945758
2013-01-06 -0.154958  1.289145  1.917362  0.136792

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.to_numpy()

array([[-0.48096446, -0.46549277, -0.31358047, -0.01563103],
       [ 0.39720009,  1.25435398, -0.00445173, -0.05679769],
       [ 0.21164327, -0.58721516,  0.43405287, -0.63229335],
       [-0.42427251, -0.23861033, -0.75016931, -1.20121428],
       [-0.37814501, -1.1543995 , -0.39502451,  0.9457581 ],
       [-0.15495801,  1.28914513,  1.91736185,  0.13679236]])

In [17]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

numpy 所有数据是一个类型，pandas中数据一列是一个类型，转化后不包含index列

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.138249  0.016297  0.148031 -0.137231
std    0.365027  1.018311  0.953976  0.727510
min   -0.480964 -1.154399 -0.750169 -1.201214
25%   -0.412741 -0.556785 -0.374664 -0.488419
50%   -0.266552 -0.352052 -0.159016 -0.036214
75%    0.119993  0.881113  0.324427  0.098687
max    0.397200  1.289145  1.917362  0.945758

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.480964    0.397200    0.211643   -0.424273   -0.378145   -0.154958
B   -0.465493    1.254354   -0.587215   -0.238610   -1.154399    1.289145
C   -0.313580   -0.004452    0.434053   -0.750169   -0.395025    1.917362
D   -0.015631   -0.056798   -0.632293   -1.201214    0.945758    0.136792

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.015631 -0.313580 -0.465493 -0.480964
2013-01-02 -0.056798 -0.004452  1.254354  0.397200
2013-01-03 -0.632293  0.434053 -0.587215  0.211643
2013-01-04 -1.201214 -0.750169 -0.238610 -0.424273
2013-01-05  0.945758 -0.395025 -1.154399 -0.378145
2013-01-06  0.136792  1.917362  1.289145 -0.154958

In [21]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05 -0.378145 -1.154399 -0.395025  0.945758
2013-01-03  0.211643 -0.587215  0.434053 -0.632293
2013-01-01 -0.480964 -0.465493 -0.313580 -0.015631
2013-01-04 -0.424273 -0.238610 -0.750169 -1.201214
2013-01-02  0.397200  1.254354 -0.004452 -0.056798
2013-01-06 -0.154958  1.289145  1.917362  0.136792

# Selection

## Getting

In [22]:
df["A"]

2013-01-01   -0.480964
2013-01-02    0.397200
2013-01-03    0.211643
2013-01-04   -0.424273
2013-01-05   -0.378145
2013-01-06   -0.154958
Freq: D, Name: A, dtype: float64

In [23]:
df.A

2013-01-01   -0.480964
2013-01-02    0.397200
2013-01-03    0.211643
2013-01-04   -0.424273
2013-01-05   -0.378145
2013-01-06   -0.154958
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.480964 -0.465493 -0.313580 -0.015631
2013-01-02  0.397200  1.254354 -0.004452 -0.056798
2013-01-03  0.211643 -0.587215  0.434053 -0.632293

In [25]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.397200  1.254354 -0.004452 -0.056798
2013-01-03  0.211643 -0.587215  0.434053 -0.632293
2013-01-04 -0.424273 -0.238610 -0.750169 -1.201214

## Selection by label

In [26]:
df.loc[dates[0]]

A   -0.480964
B   -0.465493
C   -0.313580
D   -0.015631
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.480964 -0.465493
2013-01-02  0.397200  1.254354
2013-01-03  0.211643 -0.587215
2013-01-04 -0.424273 -0.238610
2013-01-05 -0.378145 -1.154399
2013-01-06 -0.154958  1.289145

In [28]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.397200  1.254354
2013-01-03  0.211643 -0.587215
2013-01-04 -0.424273 -0.238610

In [29]:
df.loc["20130102", ["A", "B"]]

A    0.397200
B    1.254354
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0], "A"]

-0.4809644589831279

In [31]:
df.at[dates[0], "A"]

-0.4809644589831279

## Selection by position

In [32]:
df.iloc[3]

A   -0.424273
B   -0.238610
C   -0.750169
D   -1.201214
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.424273 -0.238610
2013-01-05 -0.378145 -1.154399

In [34]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.397200 -0.004452
2013-01-03  0.211643  0.434053
2013-01-05 -0.378145 -0.395025

In [35]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.397200  1.254354 -0.004452 -0.056798
2013-01-03  0.211643 -0.587215  0.434053 -0.632293

In [36]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.465493 -0.313580
2013-01-02  1.254354 -0.004452
2013-01-03 -0.587215  0.434053
2013-01-04 -0.238610 -0.750169
2013-01-05 -1.154399 -0.395025
2013-01-06  1.289145  1.917362

In [37]:
df.iloc[1, 1]

1.2543539815955778

In [38]:
df.iat[1, 1]

1.2543539815955778

## Boolean indexing

In [39]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  0.397200  1.254354 -0.004452 -0.056798
2013-01-03  0.211643 -0.587215  0.434053 -0.632293

In [40]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  0.397200  1.254354       NaN       NaN
2013-01-03  0.211643       NaN  0.434053       NaN
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05       NaN       NaN       NaN  0.945758
2013-01-06       NaN  1.289145  1.917362  0.136792

In [41]:
df2 = df.copy()

In [42]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [43]:
df2

                   A         B         C         D      E
2013-01-01 -0.480964 -0.465493 -0.313580 -0.015631    one
2013-01-02  0.397200  1.254354 -0.004452 -0.056798    one
2013-01-03  0.211643 -0.587215  0.434053 -0.632293    two
2013-01-04 -0.424273 -0.238610 -0.750169 -1.201214  three
2013-01-05 -0.378145 -1.154399 -0.395025  0.945758   four
2013-01-06 -0.154958  1.289145  1.917362  0.136792  three

In [44]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.211643 -0.587215  0.434053 -0.632293   two
2013-01-05 -0.378145 -1.154399 -0.395025  0.945758  four

## Setting

In [45]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [46]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [47]:
df["F"] = s1

In [48]:
df.at[dates[0], "A"] = 0

In [49]:
df.iat[0, 1] = 0

In [50]:
df.loc[:, "D"] = np.array([5] * len(df))

In [51]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.313580  5  NaN
2013-01-02  0.397200  1.254354 -0.004452  5  1.0
2013-01-03  0.211643 -0.587215  0.434053  5  2.0
2013-01-04 -0.424273 -0.238610 -0.750169  5  3.0
2013-01-05 -0.378145 -1.154399 -0.395025  5  4.0
2013-01-06 -0.154958  1.289145  1.917362  5  5.0

In [52]:
df2 = df.copy()

In [53]:
df2[df2 > 0] = -df2

In [54]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.313580 -5  NaN
2013-01-02 -0.397200 -1.254354 -0.004452 -5 -1.0
2013-01-03 -0.211643 -0.587215 -0.434053 -5 -2.0
2013-01-04 -0.424273 -0.238610 -0.750169 -5 -3.0
2013-01-05 -0.378145 -1.154399 -0.395025 -5 -4.0
2013-01-06 -0.154958 -1.289145 -1.917362 -5 -5.0

# Missing data

In [55]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data:

In [56]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [57]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.313580  5  NaN  1.0
2013-01-02  0.397200  1.254354 -0.004452  5  1.0  1.0
2013-01-03  0.211643 -0.587215  0.434053  5  2.0  NaN
2013-01-04 -0.424273 -0.238610 -0.750169  5  3.0  NaN

In [58]:
df1.dropna(how="any")

                 A         B         C  D    F    E
2013-01-02  0.3972  1.254354 -0.004452  5  1.0  1.0

In [59]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.313580  5  5.0  1.0
2013-01-02  0.397200  1.254354 -0.004452  5  1.0  1.0
2013-01-03  0.211643 -0.587215  0.434053  5  2.0  5.0
2013-01-04 -0.424273 -0.238610 -0.750169  5  3.0  5.0

In [60]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operation

## Stats

In [61]:
df.mean()

A   -0.058089
B    0.093879
C    0.148031
D    5.000000
F    3.000000
dtype: float64

In [62]:
df.mean(1)

2013-01-01    1.171605
2013-01-02    1.529420
2013-01-03    1.411696
2013-01-04    1.317390
2013-01-05    1.414486
2013-01-06    2.610310
Freq: D, dtype: float64

In [63]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)  # 向下移动两位，空出来的填充NaN

In [64]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [65]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.788357 -1.587215 -0.565947  4.0  1.0
2013-01-04 -3.424273 -3.238610 -3.750169  2.0  0.0
2013-01-05 -5.378145 -6.154399 -5.395025  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

## Apply

In [66]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.313580   5   NaN
2013-01-02  0.397200  1.254354 -0.318032  10   1.0
2013-01-03  0.608843  0.667139  0.116021  15   3.0
2013-01-04  0.184571  0.428528 -0.634149  20   6.0
2013-01-05 -0.193574 -0.725871 -1.029173  25  10.0
2013-01-06 -0.348532  0.563274  0.888189  30  15.0

In [67]:
df.apply(lambda x: x.max() - x.min())

A    0.821473
B    2.443545
C    2.667531
D    0.000000
F    4.000000
dtype: float64

## Histogramming

In [68]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [69]:
s

0    5
1    2
2    4
3    5
4    1
5    2
6    5
7    4
8    4
9    2
dtype: int64

In [70]:
s.value_counts()

5    3
2    3
4    3
1    1
dtype: int64

## String Methods

In [71]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [72]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object